app/controllers/api/base_controller.rb

    def fake_login_for_dev

      user = User.first || User.create!(email: 'simplex@teste.com', password: 'Teste@123', name: 'John')
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1